[
    {
        "id": 327154952912893617119583325769176196673,
        "headlines": "European Privacy Group Sues TikTok and AliExpress for Illicit Data Transfers to China",
        "author": "N/A",
        "fullNews": "Austrian privacy non-profit None of Your Business (noyb) has filed complaints accusing companies like TikTok, AliExpress, SHEIN, Temu, WeChat, and Xiaomi of violating data protection regulations in the European Union by unlawfully transferring users' data to China.  The advocacy group is seeking an immediate suspension of such transfers, stating the companies in question cannot shield user data from being potentially accessed by the Chinese government. The complaints have been filed in Austria, Belgium, Greece, Italy, and the Netherlands.  \"Given that China is an authoritarian surveillance state, it is crystal clear that China doesn't offer the same level of data protection as the E.U.,\" Kleanthi Sardeli, data protection lawyer at noyb, said . \"Transferring Europeans' personal data is clearly unlawful – and must be terminated immediately.\"  Noyb noted that the companies have no choice but to comply with Chinese authorities' requests for access to d...",
        "newsURL": "https://thehackernews.com/2025/01/european-privacy-group-sues-tiktok-and.html",
        "newsImgURL": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEihqtOCuVwvLXxZ7wztKql9c3iwOGkjM59OPVwuxscxWK4c4NAj3bAeT-SySOE0IxtOQN47vpLhaMAVgocY1lSha1PoBXBqULG8OZQzcdgYSnn3NZ42uMyYYEyUUEEmJZCLqFl8DgEUCvPPvsm3Lvwn_cjnD5HY29F8z0sDKIuGoja8lANCC9FKg4m_nKNL/w500/tick.png",
        "newsDate": "Jan 17, 2025"
    },
    {
        "id": 153435180488356720198660389639987094766,
        "headlines": "The $10 Cyber Threat Responsible for the Biggest Breaches of 2024",
        "author": "Privacy Data Protection",
        "fullNews": "You can tell the story of the current state of stolen credential-based attacks in three numbers:   Stolen credentials were the #1 attacker action  in 2023/24, and the breach vector for 80% of web app attacks . (Source: Verizon).  Cybersecurity budgets grew again in 2024, with organizations now spending almost $1,100 per user  (Source: Forrester).   Stolen credentials on criminal forums cost as little as $10  (Source: Verizon).   Something doesn't add up. So, what's going on?  In this article, we'll cover:   What's contributing to the huge rise in account compromises linked to stolen creds and why existing approaches aren't working.   The world of murky intelligence on stolen credentials, and how to cut through the noise to find the true positives.  Recommendations for security teams to stop attackers from using stolen creds to achieve account takeover.   Stolen credential-based attacks are on the rise  There's clear evidence that identity attacks are now the #1 cyber threat f...",
        "newsURL": "https://thehackernews.com/2025/01/the-10-cyber-threat-responsible-for.html",
        "newsImgURL": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjagNNKLM9kqe83TFMKVqROF_OCVUDcqv7i6XhTM0-51_kxtQM0WZhaP415DwsYD-_p5klcX_dWW-NBph7PucZhwoZU883YNwE2eMQI-3pkyxwl7KCp_0a7Lcx6x3ZggGt-PYCCnL7W1RzlGt8NQ76xARWih72pGH1ApJj6NcTR_ZFICasxrEyXCY6LFUE/w500/push.png",
        "newsDate": "Jan 16, 2025"
    },
    {
        "id": 198238319635127020128348728719032946405,
        "headlines": "Future-Ready Trust: Learn How to Manage Certificates Like Never Before",
        "author": "N/A",
        "fullNews": "Managing digital trust shouldn't feel impossible. Join us to discover how DigiCert ONE transforms certificate management—streamlining trust operations, ensuring compliance, and future-proofing your digital strategy.",
        "newsURL": "https://thehacker.news/digital-trust-enterprise?source=newsfeed",
        "newsImgURL": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhSUcZN5P-13iNj0NpXjDQu_GqoK33so-5UWmu5RGwSZI5ySnjx9JrzJ_3YfAb6aiFieLjzmTZ7De0eiQ4ljqE3HPCfT0c9MKYImMZjZ8h9fSOxXVzdn9bEKVEJD_ee_zSfyg9fCGIL-5afaXSAiMZ7qHwlsi_HTEYCvqA-lt1mFUZ16gd-oreR-n2CPWW2/w500/digi.png",
        "newsDate": "WebinarTrust Management / SSL Certificate"
    },
    {
        "id": 108316557065990827218409345013721967703,
        "headlines": "Google OAuth Vulnerability Exposes Millions via Failed Startup Domains",
        "author": "Identity Protection SaaS Security",
        "fullNews": "New research has pulled back the curtain on a \"deficiency\" in Google's \"Sign in with Google\" authentication flow that exploits a quirk in domain ownership to gain access to sensitive data.  \"Google's OAuth  login doesn't protect against someone purchasing a failed startup's domain and using it to re-create email accounts for former employees,\" Truffle Security co-founder and CEO Dylan Ayrey said  in a Monday report.   \"And while you can't access old email data, you can use those accounts to log into all the different SaaS products that the organization used.\"   The San Francisco-based company said the issue has the potential to put millions of American users' data at risk simply by purchasing a defunct domain associated with a failed startup and gaining unauthorized access to old employee accounts related to various applications like OpenAI ChatGPT, Slack, Notion, Zoom, and even HR systems.  \"The most sensitive accou...",
        "newsURL": "https://thehackernews.com/2025/01/google-oauth-vulnerability-exposes.html",
        "newsImgURL": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiw6JL17XxT5IbACWee3LpfrgwerCgKNdqZWNWB59OAYXjidLrY9u7chbYEWS73WZyzJvgJDKXDBsQZHyiw74gLLhsv8wEhNvjFx5wBWwBfb8thVaeR9cebrRY4k0fvtlgZw3Dn1jcJg_Mx892qPesDPUFXVww_8aY5j2nApc1F0TymAgXQskHiZYE5PtZl/w500/google.png",
        "newsDate": "Jan 14, 2025"
    },
    {
        "id": 163178870135181388777710209794446273400,
        "headlines": "Secure Your Azure: Proactive Tips for Cloud Protection",
        "author": "Webinar",
        "fullNews": "Discover how to boost your Azure cloud security with practical steps to help you maintain control and visibility.",
        "newsURL": "https://thehackernews.uk/azure-visibility-cheat-sheet-wiz",
        "newsImgURL": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjXOWJFbn-vEhKnRcPPy5ADdXReCpBirhoxuXbg-4Ua1EbT30r9WPJ11jv-8ZUx5eLZTWwS5jiEsDXEMAyMlQOVVpp9MvEvXiiIXJCQDTc2AxwgCsA-3xz-Z9dzEmknFFbk64p1AUjxi-FldUn3iqr84haCpth2IJBfg2V-anVkteC1u3vbZo2WziNPHmIj/s728-e100/wizz.png",
        "newsDate": "WizCloud Security"
    },
    {
        "id": 41514211562972119728697935437716387642,
        "headlines": "AI-Driven Ransomware FunkSec Targets 85 Victims Using Double Extortion Tactics",
        "author": "Trust Management SSL Certificate",
        "fullNews": "Cybersecurity researchers have shed light on a nascent artificial intelligence (AI) assisted ransomware family called FunkSec  that sprang forth in late 2024, and has claimed more than 85 victims to date.  \"The group uses double extortion tactics, combining data theft with encryption to pressure victims into paying ransoms,\" Check Point Research said  in a new report shared with The Hacker News. \"Notably, FunkSec demanded unusually low ransoms, sometimes as little as $10,000, and sold stolen data to third parties at reduced prices.\"  FunkSec launched its data leak site (DLS) in December 2024 to \"centralize\" their ransomware operations, highlighting breach announcements, a custom tool to conduct distributed denial-of-service (DDoS) attacks, and a bespoke ransomware as part of a ransomware-as-a-service (RaaS) model.  A majority of the victims are located in the U.S., India, Italy, Brazil, Israel, Spain, and Mongolia. Check Point's analysis of the group...",
        "newsURL": "https://thehackernews.com/2025/01/ai-driven-ransomware-funksec-targets-85.html",
        "newsImgURL": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiw1hInlgKu7ly8byjCkr2YYSf70xkvJxvsr0eNLKfhq-f30JZelZQ1eSXDLd7sxFrlbcqclPXTN5ikTqiVLCR9Qz_97Qp67qG49m4drlM5hKLDkShtw4uKl7bGdbbdh4YlUEBEcj3Iw-hKuknfIXUNGf7JvNMHewi5rjmFxKVqCZJCl0at-h1C2WMkDvkh/w500/ransomware.png",
        "newsDate": "Jan 10, 2025"
    },
    {
        "id": 34408865939065593560313284456553199423,
        "headlines": "E.U. Commission Fined for Transferring User Data to Meta in Violation of Privacy Laws",
        "author": "N/A",
        "fullNews": "The European General Court on Wednesday fined the European Commission, the primary executive arm of the European Union responsible for proposing and enforcing laws for member states, for violating the bloc's own data privacy regulations.  The development marks the first time the Commission has been held liable for infringing stringent data protection laws in the region.  The court determined  that a \"sufficiently serious breach\" was committed by transferring a German citizen's personal data, including their IP address and web browser metadata, to Meta's servers in the United States when visiting the now-inactive futureu.europa[.]eu website in March 2022.   The individual registered for one of the events on the site by using the Commission's login service, which included an option to sign in using a Facebook account.  \"By means of the 'Sign in with Facebook' hyperlink displayed on the E.U. Login webpage, the Commission created the conditions for t...",
        "newsURL": "https://thehackernews.com/2025/01/eu-commission-fined-for-transferring.html",
        "newsImgURL": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhkWLS9GePIHhrsixu7WstMvQAOPZjdNxtrHk8GhQ20hzdvpBS2cZqlSG2k_q-TTIFwju1bSETvEzsOcUGrOalaM1Yq2GeMvZaH0jVMAsUa5BYVhHWroMYif2KqjqZgHKR8ZXzyF2MAh5nZnjsHut6LR4GXwUlmLEldTDDOddpwh7Beby_eU6NlOiWjeg0C/w500/EU.png",
        "newsDate": "Jan 09, 2025"
    },
    {
        "id": 288910314410995729803457568086785806864,
        "headlines": "Top 5 Malware Threats to Prepare Against in 2025",
        "author": "Vulnerability Data Privacy",
        "fullNews": "2024 had its fair share of high-profile cyber attacks, with companies as big as Dell and TicketMaster falling victim to data breaches and other infrastructure compromises. In 2025, this trend will continue. So, to be prepared for any kind of malware attack, every organization needs to know its cyber enemy in advance. Here are 5 common malware families that you can start preparing to counter right now.  Lumma  Lumma is a widely available malware designed to steal sensitive information. It has been openly sold on the Dark Web since 2022. This malware can effectively collect and exfiltrate data from targeted applications, including login credentials, financial information, and personal details.  Lumma is regularly updated to enhance its capabilities. It can log detailed information from compromised systems, such as browsing history and cryptocurrency wallet data. It can be used to install other malicious software on infected devices. In 2024, Lumma was distributed through various methods...",
        "newsURL": "https://thehackernews.com/2025/01/top-5-malware-threats-to-prepare.html",
        "newsImgURL": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiSHl1lOzOTW49RLVW7pnESvdVkjr_sN324MDZ_Dnehg3PDuzwY7SLsTSocro3oaGi6itIkKn2ze38yDsyNJ1SisC0Va-bYcB5nLqq_VxQGh8xQqEHloFrLETXTnk-cnCjOnO2VjaySzj1TGXDDcdcXO909CtxNJ3I0Aium3CYR9W3QBYc_I8she61WGCs/w500/top-5-malware.png",
        "newsDate": "Jan 08, 2025"
    },
    {
        "id": 184077417462121776374659456738417921733,
        "headlines": "India Proposes Digital Data Rules with Tough Penalties and Cybersecurity Requirements",
        "author": "Cloud Security",
        "fullNews": "The Indian government has published  a draft version of the Digital Personal Data Protection (DPDP) Rules for public consultation.  \"Data fiduciaries must provide clear and accessible information about how personal data is processed, enabling informed consent,\" India's Press Information Bureau (PIB) said  in a statement released Sunday.  \"Citizens are empowered with rights to demand data erasure, appoint digital nominees, and access user-friendly mechanisms to manage their data.\"  The rules, which seek to operationalize the Digital Personal Data Protection Act, 2023, also give citizens greater control over their data, providing them with options for giving informed consent to processing their information, as well as the right to erase with digital platforms and address grievances.  Companies operating in India are further required to implement security measures, such as encryption, access control, and data backups, to safeguard personal data, and ensure its c...",
        "newsURL": "https://thehackernews.com/2025/01/india-proposes-digital-data-rules-with.html",
        "newsImgURL": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgLMGB51b1llpNozqYjMaEetbUMwdMybReee_S2aBQTENFXTIOS20YTsj-ymWiWHA5ywOZ7fjxMvH99y4SiV_7Mks7iJz5BHOuVPKfnQ_GYd4fGJOYsG7yyBvHGBDUbsAMNyY8I3mhFBcYAxmUC6EpWLRDQF4uOtPn44JBI_t33w6BlZdgDQDYixdsDNOLS/w500/india-data.png",
        "newsDate": "Jan 06, 2025"
    },
    {
        "id": 47648816942597988535217141279078105218,
        "headlines": "⚡ THN Weekly Recap: Top Cybersecurity Threats, Tools and Tips [6 Jan]",
        "author": "N/A",
        "fullNews": "Every tap, click, and swipe we make online shapes our digital lives, but it also opens doors—some we never meant to unlock. Extensions we trust, assistants we rely on, and even the codes we scan are turning into tools for attackers. The line between convenience and vulnerability has never been thinner.  This week, we dive into the hidden risks, surprising loopholes, and the clever tricks cybercriminals are using to outsmart the systems we depend on.  Stay with us as we unpack what's happening behind the screen and how you can stay one step ahead.  ⚡ Threat of the Week  Dozens of Google Chrome Extensions Caught Stealing Sensitive Data — The challenges with securing the software supply chain reared once again after about three dozen extensions were found surreptitiously siphoning sensitive data  from roughly 2.6 million devices for several months as part of two related campaigns. The compromises came to light after data loss prevention service Cyberhaven revealed that its browser extens...",
        "newsURL": "https://thehackernews.com/2025/01/thn-weekly-recap-top-cybersecurity.html",
        "newsImgURL": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiKokWQpcRQ55ARtaBLhn4X9RCRcf5u5YW7JaJaQrIrcU6A96dBP2IS5th1jhuZX0cQMO04KAMOZDxqEIcPdkAqGmkXMpHzV7L_CECca3FJ_ppgWQh9J0y8D02mSQbw-nzuf-FzDIN412s_F2AO-MGpfr95e-yMTzPjQqkl-WKo8jY1o6XMVvnF7bEmngEk/w500/recap.png",
        "newsDate": "Jan 06, 2025"
    },
    {
        "id": 323494838181344724255871176602243624249,
        "headlines": "Financial institutions double down on more checks for tech partners",
        "author": "N/A",
        "fullNews": "Signzy, a regulatory technology firm, suffered a massive data breach, leaking customer data of financial institutions.  This has prompted these institutions to evaluate backup service providers and tighten data-sharing norms.  The breach exposed customer IDs, addresses, contact numbers, and video recordings, raising concerns about the vulnerability of third-party data storage.",
        "newsURL": "/news/data-breaches/financial-institutions-double-down-on-more-checks-for-tech-partners/116125812?utm_source=category_listing&utm_medium=sectionListing",
        "newsImgURL": "https://etimg.etb2bimg.com/thumb/img-size-2565646/116125812.cms?width=150&height=112",
        "newsDate": "N/A"
    },
    {
        "id": 149023773864233184702574346483690834385,
        "headlines": "ByteDance seeks $1.1 million damages from intern in AI breach case: Report",
        "author": "N/A",
        "fullNews": "China's ByteDance is suing a former intern for $1.1 million, alleging he deliberately attacked its artificial intelligence large language model training infrastructure, a case that has drawn widespread attention within China amid a heated AI race.",
        "newsURL": "/news/data-breaches/bytedance-seeks-1-1-million-damages-from-intern-in-ai-breach-case-report/115792744?utm_source=category_listing&utm_medium=sectionListing",
        "newsImgURL": "https://etimg.etb2bimg.com/thumb/img-size-15066/115792744.cms?width=150&height=112",
        "newsDate": "N/A"
    },
    {
        "id": 90608589127223438003135354591070637260,
        "headlines": "UPDATE 1-New York fines Geico $9.8 million over data breach",
        "author": "N/A",
        "fullNews": "INSURANCE-DATAPROTECTION-New York fines Geico $9.8 million over data breach",
        "newsURL": "/news/data-breaches/update-1-new-york-fines-geico-9-8-million-over-data-breach/115683489?utm_source=category_listing&utm_medium=sectionListing",
        "newsImgURL": "https://etimg.etb2bimg.com/thumb/img-size-4218/115683489.cms?width=150&height=112",
        "newsDate": "N/A"
    },
    {
        "id": 220850149382392690684966643362376028561,
        "headlines": "Facebook users affected by data breach eligible for compensation, German court says",
        "author": "N/A",
        "fullNews": "Facebook users affected by data breach eligible for compensation, German court says",
        "newsURL": "/news/data-breaches/facebook-users-affected-by-data-breach-eligible-for-compensation-german-court-says/115438376?utm_source=category_listing&utm_medium=sectionListing",
        "newsImgURL": "https://etimg.etb2bimg.com/thumb/img-size-3037/115438376.cms?width=150&height=112",
        "newsDate": "N/A"
    },
    {
        "id": 106060294829266401358792486585300998537,
        "headlines": "Turkey fines Amazon's Twitch 2 million lira for data breach",
        "author": "N/A",
        "fullNews": "Turkey's Personal Data Protection Board fined Twitch $58,000 for a data breach affecting 35,274 individuals in the country. The board found Twitch failed to implement adequate security measures before the breach and only addressed the issue afterward. The fine includes penalties for insufficient security and failing to report the breach.",
        "newsURL": "/news/data-breaches/turkey-fines-amazons-twitch-2-million-lira-for-data-breach/115405112?utm_source=category_listing&utm_medium=sectionListing",
        "newsImgURL": "https://etimg.etb2bimg.com/thumb/img-size-39952/115405112.cms?width=150&height=112",
        "newsDate": "N/A"
    },
    {
        "id": 233323547230356124147810688254268132767,
        "headlines": "T-Mobile hacked in massive Chinese breach of telecom networks: Report",
        "author": "N/A",
        "fullNews": "\"T-Mobile is closely monitoring this industry-wide attack,\" a company spokesperson told Reuters in an email.",
        "newsURL": "/news/data-breaches/t-mobile-hacked-in-massive-chinese-breach-of-telecom-networks-report/115356410?utm_source=category_listing&utm_medium=sectionListing",
        "newsImgURL": "https://etimg.etb2bimg.com/thumb/img-size-199428/115356410.cms?width=150&height=112",
        "newsDate": "N/A"
    },
    {
        "id": 247555805087067302128939930779931922585,
        "headlines": "German stats body says suffered possible data breach",
        "author": "N/A",
        "fullNews": "Germany's national statistics agency Destatis said Friday it had been the victim of a suspected data leak, following a media report that the organisation had been attacked by pro-Russian hackers. According to the NZZ, the attack was carried out by a group of pro-Russian hackers from Indonesia who have said they want to target NATO countries with their operations.",
        "newsURL": "/news/data-breaches/german-stats-body-says-suffered-possible-data-breach/115356401?utm_source=category_listing&utm_medium=sectionListing",
        "newsImgURL": "https://etimg.etb2bimg.com/thumb/img-size-137878/115356401.cms?width=150&height=112",
        "newsDate": "N/A"
    },
    {
        "id": 340085707992405707464657684384997120648,
        "headlines": "German stats body says suffered possible data breach",
        "author": "N/A",
        "fullNews": "Germany's national statistics agency Destatis said Friday it had been the victim of a suspected data leak, following a media report that the organisation had been attacked by pro-Russian hackers. According to the NZZ, the attack was carried out by a group of pro-Russian hackers from Indonesia who have said they want to target NATO countries with their operations.",
        "newsURL": "/news/data-breaches/german-stats-body-says-suffered-possible-data-breach/115356146?utm_source=category_listing&utm_medium=sectionListing",
        "newsImgURL": "https://etimg.etb2bimg.com/thumb/img-size-137878/115356146.cms?width=150&height=112",
        "newsDate": "N/A"
    },
    {
        "id": 303592200653162044969705659654673175838,
        "headlines": "Equinox discloses data breach involving health info of clients, staff",
        "author": "N/A",
        "fullNews": "EQUINOX-CYBERATTACK/Equinox discloses data breach involving health info of clients, staff",
        "newsURL": "/news/data-breaches/equinox-discloses-data-breach-involving-health-info-of-clients-staff/115355746?utm_source=category_listing&utm_medium=sectionListing",
        "newsImgURL": "https://etimg.etb2bimg.com/thumb/img-size-114899/115355746.cms?width=150&height=112",
        "newsDate": "N/A"
    },
    {
        "id": 210691724613316862498986396453404601176,
        "headlines": "Amazon confirms employee data hacked in the biggest cyberattack of 2023",
        "author": "N/A",
        "fullNews": "Amazon confirmed a data breach involving employee contact information due to a security lapse at a third-party property management vendor. The breach, linked to the MOVEit Transfer exploit, exposed work email addresses, phone numbers, and building locations. Amazon stated its core systems remain secure.",
        "newsURL": "/news/data-breaches/amazon-confirms-employee-data-hacked-in-the-biggest-cyberattack-of-2023/115209365?utm_source=category_listing&utm_medium=sectionListing",
        "newsImgURL": "https://etimg.etb2bimg.com/thumb/img-size-39952/115209365.cms?width=150&height=112",
        "newsDate": "N/A"
    },
    {
        "id": 173662316853654984356636798602258196637,
        "headlines": "Big crackdown on unauthorised use of PAN card details! Here’s what the government is doing",
        "author": "N/A",
        "fullNews": "Big crackdown on PAN details unauthorised use! The government is taking action against tech companies using citizen's data in an unauthorised way.  Many companies were using PAN numbers to access personal information like addresses and phone numbers.",
        "newsURL": "/news/data-breaches/big-crackdown-on-unauthorised-use-of-pan-card-details-heres-what-the-government-is-doing/115004174?utm_source=category_listing&utm_medium=sectionListing",
        "newsImgURL": "https://etimg.etb2bimg.com/thumb/img-size-64924/115004174.cms?width=150&height=112",
        "newsDate": "N/A"
    }
]